# Week 4

## Logistic Regression(Gapminder)

### Importing Libraries

In [2]:
import numpy as np
import pandas as pd
import statsmodels.formula.api as sp

### Importing Dataset

In [3]:
data1 = pd.read_csv("gapminder.csv")

In [4]:
data2 = data1.iloc[:,[0,1,2,3,9,14]].copy()

In [5]:
data2.head()

,country,incomeperperson,alcconsumption,armedforcesrate,lifeexpectancy,employrate
0,Afghanistan,,.03,.5696534,48.673,55.7000007629394
1,Albania,1914.99655094922,7.29,1.0247361,76.918,51.4000015258789
2,Algeria,2231.99333515006,.69,2.306817,73.131,50.5
3,Andorra,21943.3398976022,10.17,,,
4,Angola,1381.00426770244,5.57,1.4613288,51.093,75.6999969482422

In [6]:
data2.columns = ["country","income","alcohol","forces","life","employment"]

### Converting data to float and filling missing with na

In [7]:
def fun1(a):
    
    for i in range(len(a)):
        if a[i] ==" ":
            a[i] = np.nan
        else :
            a[i] = float(a[i])
            
    x = np.mean(a.dropna())
    for i in range(len(a)):
        if np.isnan(a[i]):
            a[i] = x

In [8]:
for i in data2.columns[1:] :
    fun1(data2[i])

In [9]:
data2.head()

       country   income alcohol    forces     life employment
0  Afghanistan  8740.97    0.03  0.569653   48.673       55.7
1      Albania     1915    7.29   1.02474   76.918       51.4
2      Algeria  2231.99    0.69   2.30682   73.131       50.5
3      Andorra  21943.3   10.17   1.44402  69.7535     58.636
4       Angola     1381    5.57   1.46133   51.093       75.7

### Removing outliers

In [57]:
data3 = data2.iloc[:,[1,2,4,5]].copy()

def fun2(a):
    
    mean = np.mean(a)
    std = np.std(a)
    mx = mean + 3*std
    mn = mean - 3*std
    
    for i in range(len(a)):
        if (a[i]>mx)|(a[i]<mn):
            a[i] = np.nan
        

for i in data3.columns:
    fun2(data3[i])

data3 = data3.dropna()
data3.head()

    income alcohol     life employment
0  8740.97    0.03   48.673       55.7
1     1915    7.29   76.918       51.4
2  2231.99    0.69   73.131       50.5
3  21943.3   10.17  69.7535     58.636
4     1381    5.57   51.093       75.7

In [46]:
len(data2)-len(data3)

5

This shows 5 rows were dropped as outliers

# Logistic regression

Since we will be studying if one lives above 70 or not we will categorize life column as 1 if it is >70 and 0 if less than 70
and we will be centering rest of the columns

In [58]:
def fun3(a):
    
    x = np.mean(a)
    # print(x)
    for i in range(len(a)):
        # print(i)
        a.iloc[i] = a.iloc[i]-x

In [59]:
fun3(data3["income"])
fun3(data3["alcohol"])
fun3(data3["employment"])

In [60]:
def fun4(a):
    if a>70:
        return 1
    else :
        return 0

In [61]:
data3["life"] = list(map(fun4,data3["life"]))

In [62]:
data3["life"].value_counts()

1    114
0     94
Name: life, dtype: int64

In [63]:
data3.head()

    income   alcohol  life employment
0   1243.6  -6.55138     0   -3.02957
1 -5582.37  0.708623     1   -7.32957
2 -5265.37  -5.89138     1   -8.22957
3    14446   3.58862     0  -0.093615
4 -6116.36  -1.01138     0    16.9704

In [71]:
data3["income"] = pd.to_numeric(data3["income"])
data3["alcohol"]  = pd.to_numeric(data3["alcohol"])
data3["employment"] = pd.to_numeric(data3["employment"])
data3["life"] = pd.to_numeric(data3["life"])

In [72]:
data3

           income   alcohol  life  employment
0     1243.602481 -6.551377     0   -3.029569
1    -5582.367044  0.708623     1   -7.329569
2    -5265.370260 -5.891377     1   -8.229570
3    14445.976302  3.588623     0   -0.093615
4    -6116.359327 -1.011377     0   16.970427
..            ...       ...   ...         ...
208  -6774.556036 -2.671377     1   12.270430
209   1243.602481  0.108035     1  -26.729570
210  -6887.006228 -6.381377     0  -19.729570
211  -7065.137258 -3.021377     0    2.270430
212  -7176.591705 -1.621377     0    8.070433

[208 rows x 4 columns]

## Final model

In [73]:
model = sp.logit("life ~ employment",data=data3).fit()

Optimization terminated successfully.
         Current function value: 0.637435
         Iterations 5

In [75]:
print(model.summary())

                           Logit Regression Results
==============================================================================
Dep. Variable:                   life   No. Observations:                  208
Model:                          Logit   Df Residuals:                      206
Method:                           MLE   Df Model:                            1
Date:                Tue, 28 Jul 2020   Pseudo R-squ.:                 0.07419
Time:                        23:55:27   Log-Likelihood:                -132.59
converged:                       True   LL-Null:                       -143.21
Covariance Type:            nonrobust   LLR p-value:                 4.030e-06
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      0.2105      0.147      1.434      0.152      -0.077       0.498
employment    -0.0726      0.017     -4.234      0.000      -0.106      -0.039
==============================================================================

P value very high model insignificant

In [76]:
model = sp.logit("life ~ employment+alcohol",data=data3).fit()

Optimization terminated successfully.
         Current function value: 0.601963
         Iterations 5

In [77]:
print(model.summary())

                           Logit Regression Results
==============================================================================
Dep. Variable:                   life   No. Observations:                  208
Model:                          Logit   Df Residuals:                      205
Method:                           MLE   Df Model:                            2
Date:                Tue, 28 Jul 2020   Pseudo R-squ.:                  0.1257
Time:                        23:56:46   Log-Likelihood:                -125.21
converged:                       True   LL-Null:                       -143.21
Covariance Type:            nonrobust   LLR p-value:                 1.518e-08
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      0.2337      0.153      1.527      0.127      -0.066       0.534
employment    -0.0701      0.017     -4.059      0.000      -0.104      -0.036
alcohol        0.1363      0.038      3.631      0.000       0.063       0.210
==============================================================================

employment coefecient changed so alcohol is a confounding variable but p value is still pretty high so insignificant

In [78]:
model = sp.logit("life ~ employment+alcohol+income",data=data3).fit()

Optimization terminated successfully.
         Current function value: 0.520708
         Iterations 6

In [79]:
print(model.summary())

                           Logit Regression Results
==============================================================================
Dep. Variable:                   life   No. Observations:                  208
Model:                          Logit   Df Residuals:                      204
Method:                           MLE   Df Model:                            3
Date:                Tue, 28 Jul 2020   Pseudo R-squ.:                  0.2437
Time:                        23:58:17   Log-Likelihood:                -108.31
converged:                       True   LL-Null:                       -143.21
Covariance Type:            nonrobust   LLR p-value:                 4.690e-15
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      0.3611      0.182      1.988      0.047       0.005       0.717
employment    -0.0756      0.019     -3.948      0.000      -0.113      -0.038
alcohol        0.0814      0.039      2.088      0.037       0.005       0.158
income         0.0001   2.95e-05      4.420      0.000    7.26e-05       0.000
==============================================================================

P value is low so this model is significant

In [80]:
print(np.exp(model.params))

Intercept     1.434905
employment    0.927216
alcohol       1.084763
income        1.000130
dtype: float64

# Summary

including all variable helped make the model significant odd ratios can be seen in the above step p value is less than 0.5 . here we are getting the probablity of age being greater than 70 and according to the model increases alcohol is the best way to increase the odds although it does sound a bit hypocritical but the data shows this